IDEA Open Model
SteelSetupAISC Properties
Compatible with IDEA StatiCa v 10.1
The SteelSetupAISC type exposes the following members.
Properties
Name | Description
BoltBearing_Omega
 Safety factor BoltBearing_Omega
BoltBearing_Phi
 Safety factor BoltBearing_Phi
BoltSlipRes_Omega
 Safety factor BoltSlipRes_Phi
BoltSlipRes_Phi
 Safety factor BoltSlipRes_Phi
BoltTensileShear_Omega
 Safety factor BoltTensileShear_Omega
BoltTensileShear_Phi
 Safety factor BoltTensileShear_Phi
BoltTensileShearCombined_Omega
 Safety factor BoltTensileShearCombined_Omega
BoltTensileShearCombined_Phi
 Safety factor BoltTensileShearCombined_Phi
FilletWelds_Omega
 Safety factor FilletWelds_Omega
FilletWelds_Phi
 Safety factor FilletWelds_Phi
MaterialFy_Omega
 Safety factor MaterialFy_Omega
MaterialFy_Phi
 Safety factor MaterialFy_Phi
ReductionFactorShear
 ACI 318
ReductionFactorTension
 ACI 318
Top
See Also
Reference
SteelSetupAISC Class
IdeaRS.OpenModel Namespace